package messages

const (
	StartCommand string = `Привет! Я – твой личный помощник, который помогает создавать уютные папочки для заметок и ссылок.😬 
Со мной ты можешь:

• Организовывать свои идеи и интересные материалы в папки  📁
• Быстро находить сохранённые заметки и ссылки именно тогда, когда они понадобятся 🔍

Чтобы начать – просто отправь мне сообщение с заметкой или ссылкой – и я сразу её сохраню для тебя. Если хочешь увидеть свои папки или создать новую - нажми кнопку 📂`
	FoldersCaption string = "📌 Мои папки"
	UnknownCommand string = "Не знаю о чем ты. О чем ты? 🤔"
	Error          string = "Ой! Не делай так... 😵"
	NotesIsEmpty   string = "Ничего нет 🕵🏼"
	NoteCreated    string = "Запись добавлена ✏️"
	Moved          string = "✏️"
	NoteRemoved    string = "Запись удалена 🧹"
	EmptyMessage   string = "▲▲▲▲▲"
)

const (
	FolderEmoji          string = "📁"
	AskFolderName        string = "Название папки?"
	FolderIsEmpty        string = "Нету папочек 🕵🏼"
	FolderCreated        string = "А вот и папочка ✏️"
	FolderNotExists      string = "Нет такой папки"
	FolderDeleted        string = "Папка удалена"
	WrongFolder          string = "Эту нинада"
	ChooseFolderToMove   string = "Выбери папку, в которую хочешь переместить заметку"
	ChooseFolderToDelete string = "Выбери папку, которую хочешь удалить"
)
